[{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"K & S is great..... so is Dan!","author":"Martha H","time":1530860400000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"I just started using them from the recommendation of a family member and they are great. They gave me the best price out of 4 other company quotes on a new unit, and the service people are excellent. The come when they say and call you before they come out. The service after the sale is also excellent because they take care of any issues that may happen later. I definitely would recommend K&S.","author":"Jay W","time":1530860400000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"I've had been hearing about K&S air on KLTY Radio for months and finally decided to give them a call to service our AC system. I was very pleased with their service it was kind courteous and Timely! I will definitely be using their services again in the future. I have already recommended them to my mother-in-law. Thank you very much K& S air for a very professional service!","author":"Morgan w","time":1528441200000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"Incredible confidence in the service and honesty I received. Very personable and professional staff from the appointment making phase to the service call by Andrew. Thank you!","author":"Molly P","time":1528182000000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"I had a service call from K & S Air today and could not be more pleased with the quality of service and the price. On time, found the problem and had the repair made in minutes. Very professional and courteous. I highly recommend K & S Air.","author":"Annabeth B","time":1527577200000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"Hector was great. He answered all our questions to our utmost satisfaction, not averse to answering the same question twice. He spent time carrying out all checks, made sure to address even the slightest issue. He even adjusted the vents, even on which had to be reached by climbing up a chair. It feels good when we receive such service, thus softening the rather steep annual maintenance contract price.","author":"Vasant G","time":1526022000000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"KNS tech Kris provided the perfect customer service experience. He provided answers to all my questions and concerns.","author":"Norman G","time":1524812400000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"K&S has been great to us. *** & ***** are always quickly responsive. The technicians are always polite, professional, and experienced. Our tech today was Mike who has been for preventative maintenance before. As usual, he was thorough and efficient. Top notch group of people there. All three of our A/C units are from K&S. Las Colinas (Irving)","author":"John L","time":1523948400000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"Mike was great. Very knowledgeable and professional. Would definitely recommend to family and friends.","author":"Shelley S","time":1521183600000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"5 stars! Kelvin and Kris where great. They were very professional and informative of what they were doing. Great service at a great price!","author":"Monty S","time":1521097200000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"Dan came out and did a fantastic job with everything and went above and beyond explaining the system as well. Would definitely recommend this company!","author":"Casey G","time":1510815600000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"K&S provides my twice yearly preventative HVAC maintenance. Their service is the best I've ever had. Dan always provides outstanding care of our home units and is very courteous.","author":"Gerry P","time":1510297200000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"K&S scheduled the visit on same day on my request and sent Dan. Dan has great experience and he gave his precious advice on various aspects. He was simply superb. I was impressed with his great knowledge and support.","author":"Abhishek J","time":1509692400000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"Dan came out to service my unit, he explained everything he was doing. He was great.","author":"Rhonda C","time":1509606000000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"We have been very pleased with K&S. The sales rep, office staff and technicians have all been great to work with.","author":"Kathy M","time":1509433200000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"I've had excellent service from K & S for the past 4.5 years I've been here. Is use the yearly maintenance program and have always had competent, polite service technicians.","author":"Justin H","time":1508828400000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"Dan was very informational and pationate about his field of work. Would highly recommend this company.","author":"James L","time":1505804400000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"I had an issue with my AC in a new home. Salvador from K&S Heating and Air was very quick to point out the extended features of the system and why the AC was acting different. He was very professional, courteous, and knowledgeable. He also listened very well and offered some options according to what I had said to him in conversation.","author":"Garry C","time":1504854000000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"Dan is the best. Professional caring. Jr in the office. Really I would say everyone in the office. I got excellent service and fast. Please use this company!","author":"Pamela W","time":1501484400000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"We have been customers with K & S Heating and Air for the last 10 years and are always pleased with their service and professionalism. When our house was severely damaged by hail, they bent over backwards to help us repair our damaged system. When they come to do our 6 month service checkups, they are always very honest and thorough. We trust them and have recommended them to many of our family and friends. Ask for Dan. He is great.","author":"Janice B","time":1501225200000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"Dan, the technician was very professional and did a great job of explaining everything to me. I will definitely recommend K&S.","author":"Barbara A","time":1499842800000,"rank":5,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"Best experience as far as an AC company goes.","author":"Chris M","time":1491289200000,"rank":3,"source":"BBB"},{"avatar":"https://cdn.pixabay.com/photo/2017/02/25/22/04/user-icon-2098873_960_720.png","body":"K&S has been servicing my systems for the past 3 years. Recently, my AC unit quit working. I spoke with the Service Director, Junior, who offered some options for repair or replacement. He sent one of his techs - Russell - who was very knowledgeable and proficient. We identified the problem and I made an informed decision to replace the condenser. K&S then sent their install tech - Manuel - to install new unit. The system was set up and working within 40 minutes. I can't say enough about K&S. Good company and great people - Manuel, Russell & Junior - deserved to be recognized. So does Vanessa who assisted with payment plan and scheduling!","author":"Mike M","time":1469430000000,"rank":5,"source":"BBB"}]